src/main/resources/login-user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://techprimers.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
       <us:loginUser>
           <us:email></us:email>
           <us:password></us:password>
       </us:loginUser>
    </soapenv:Body>
</soapenv:Envelope>